InformationRegisters/Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Итоги</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗабито</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПропущено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Итоги/Ext/ManagerModule.bsl
Процедура ИтогиОбновить(Чемпионат) Экспорт
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		//
	ИначеЕсли Чемпионат.Владелец.ОлимпийскаяСистема Тогда
		//
	ИначеЕсли ЧемпионатЗакончен(Чемпионат) Тогда
		ИтогиЗаписать(Чемпионат);
	КонецЕсли;
КонецПроцедуры

Функция ЧемпионатЗакончен(Чемпионат)
	Возврат СерверныйФункции.ЧемпионатЗакончен(Чемпионат);
КонецФункции

Процедура ИтогиЗаписать(Чемпионат)
	Гель	= Новый Структура("Период,Чемпионат,Место", Чемпионат.ДатаОкончания, Чемпионат, 1);
	Выборка	= СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
	Пока Выборка.Следующий() Цикл
		НЗ		= РегистрыСведений.Итоги.СоздатьНаборЗаписей();
		НЗ.Отбор.Чемпионат.Установить(Чемпионат);
		НЗ.Отбор.Команда.Установить(Выборка.Команда);
		Запись	= НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		ЗаполнитьЗначенияСвойств(Запись, Гель);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
		
		Гель.Место	= Гель.Место +1;
	КонецЦикла;
КонецПроцедуры
